app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    order = params[:sidx] && params[:sidx].length >0 && params[:sord] && params[:sord].length > 0  ?  "#{params[:sidx]} #{params[:sord]}" : nil

    @products = Product.paginate :page => params[:page], :per_page => params[:rows], :order => order